{
  "Version": "1.3",
  "ID": "f1em7yhgdfjccx52rjlonotj4tqerb4xlyi24msdi",
  "Issue Number": "6",
  "Client": {
    "Name": "muoketv",
    "Region": "China",
    "Industry": "Information, Media & Telecommunications",
    "Website": "http://www.muoketv.com/",
    "Social Media": "http://www.muoketv.com/",
    "Social Media Type": "Other",
    "Role": "Data Preparer"
  },
  "Project": {
    "Brief history of your project and organization": "**Henan Muke Film & Culture Media Co., Ltd.** pursues high quality as its corporate goal, and is committed to crafting promotional videos, documentaries, feature programs, presentation films, advertisements, web films, MG animations, 3D animations, VR experiences, and other marketing-oriented video products with a craftsman spirit of dedication, precision, and excellence.\n\nWe keep pace with the latest developments and technological advancements in the global digital media industry, ensuring that our creative concepts and production techniques remain aligned with international standards, providing clients with top-tier film products and technical services.\n\nGuided by the inherent laws of industrial operations, and adapting to the trend of enterprise platform-based development in the digital age, we utilize innovative business ideas and effective market strategies to significantly reduce production costs. This allows us to offer high-quality, affordable marketing video solutions, earning us the reputation as the “King of Value” among our valued clients.",
    "Is this project associated with other projects/ecosystem stakeholders?": "No",
    "Describe the data being stored onto Filecoin": "Promotional videos, documentaries, feature films, presentation videos, advertisements, web films, MG animations, 3D animations, VR experiences, and other data.",
    "Where was the data currently stored in this dataset sourced from": "My Own Storage Infra",
    "How do you plan to prepare the dataset": "As a data preparer, the first step is to clarify the data requirements and application scenarios, such as using the data for real data storage incentive programs in the Filecoin network.\nNext, we collect authentic data that meets the criteria, such as public datasets, multimedia files, or blockchain data, ensuring its legality and compliance.\nThe data is then organized into formats suitable for IPFS and Filecoin storage, which typically includes splitting the data into blocks and constructing a Merkle tree structure to generate Content Identifiers (CIDs).\nTools such as IPFS, FIL+ official clients (like Lotus), and DataCap Bot are used to package the data and generate CAR files, preparing it for on-chain submission.\nTechnically, the node environment needs to be set up properly (e.g., Ubuntu system, GPU support), with Lotus installed and synchronized with the mainnet to ensure the capability of submitting storage power.\nOnce data packaging is complete, the data is uploaded to the Filecoin network via a Storage Provider (miner), and a storage deal contract is signed to complete the sealing process.\nFinally, relevant proof materials are submitted to the DataCap review team to apply for a DataCap quota, supporting the incentive mechanism for real data storage.\n",
    "Please share a sample of the data (a link to a file, an image, a table, etc., are good ways to do this.)": "http://www.muoketv.com/ysphy",
    "Confirm that this is a public dataset that can be retrieved by anyone on the network (i.e., no specific permissions or access rights are required to view the data)": "[x] I confirm",
    "What is the expected retrieval frequency for this data": "Sporadic",
    "For how long do you plan to keep this dataset stored on Filecoin": "2 to 3 years",
    "In which geographies do you plan on making storage deals": "Greater China, Asia other than Greater China, North America, Australia (continent), Europe",
    "How will you be distributing your data to storage providers": "HTTP or FTP server, Shipping hard drives",
    "Please list the provider IDs and location of the storage providers you will be working with. Note that it is a requirement to list a minimum of 5 unique provider IDs, and that your client address will be verified against this list in the future": "f02826762\nf02827135\nf02827010\nf02825281 \nf03610683\nf02827953\nf02827843\nf02827109\nf02826602\nf02825675\nf01708981\nf03611998\nf03623218",
    "Can you confirm that you will follow the Fil+ guideline (Data owner should engage at least 4 SPs and no single SP ID should receive >30% of a client's allocated DataCap)": "Yes"
  },
  "Datacap": {
    "Type": "ldn-v3",
    "Data Type": "Slingshot",
    "Total Requested Amount": "10PiB",
    "Single Size Dataset": "1PiB",
    "Replicas": 10,
    "Weekly Allocation": "1200TiB"
  },
  "Lifecycle": {
    "State": "Granted",
    "Validated At": "2025-07-08 07:24:16.677164818 UTC",
    "Validated By": "METAVERSEDATAMINING",
    "Active": true,
    "Updated At": "2025-07-08 07:24:16.677161328 UTC",
    "Active Request ID": "952ab324-46bd-4613-af7b-83c740272020",
    "On Chain Address": "f1em7yhgdfjccx52rjlonotj4tqerb4xlyi24msdi",
    "Multisig Address": "false",
    "edited": true
  },
  "Allocation Requests": [
    {
      "ID": "952ab324-46bd-4613-af7b-83c740272020",
      "Request Type": "First",
      "Created At": "2025-07-08 07:14:45.937728831 UTC",
      "Updated At": "2025-07-08 07:14:45.937729699 UTC",
      "Active": false,
      "Allocation Amount": "562949953421312 B",
      "Signers": [
        {
          "Github Username": "METAVERSEDATAMINING",
          "Signing Address": "f1uhdgxklhmone6l3xjikxrs6zciitf6o5aipapfa",
          "Created At": "2025-07-08 07:18:49.145000000 UTC",
          "Message CID": "bafy2bzaceavdxdrx4hoogwd5bgpeymf7ahrxtqsmqkxtk767wf5vfeuyb632k"
        },
        {
          "Github Username": "METAVERSEDATAMINING",
          "Signing Address": "f1kqjoordnccf5xf46uw25tc5xxtoxmzjk5erqcrq",
          "Created At": "2025-07-08 07:24:13.053000000 UTC",
          "Message CID": "bafy2bzacecw5cwljtveuikf3zs65ywbjlwm3e27pgzn7rna6mqjnclzxkomm4"
        }
      ]
    }
  ]
}